{
     "intents": [
          {
               "tag": "noanswer",
               "patterns": [],
               "responses": [
                    "Sorry, can't understand you",
                    "Please give me more info",
                    "Not sure I understand"
               ],
               "context": [
                    ""
               ]
          },
          {
               "tag": "greeting",
               "patterns": [
                    "Hi",
                    "Hello",
                    "Hey",
                    "Hii",
                    "there"
               ],
               "responses": [
                    "Hello, how can I help?",
                    "Good to see you, how can I help you?",
                    "Hi there, how can I help?"
               ],
               "context": [
                    ""
               ]
          },
          {
               "tag": "goodbye",
               "patterns": [
                    "Bye",
                    "See you later",
                    "Goodbye",
                    "Close",
                    "Nice chatting to you, bye",
                    "Till next time"
               ],
               "responses": [
                    "See you!",
                    "Have a nice day",
                    "Bye! Come back again soon."
               ],
               "context": [
                    ""
               ]
          },
          {
               "tag": "thanks",
               "patterns": [
                    "Thanks",
                    "Thank you",
                    "Awesome, thanks",
                    "Wow",
                    "Amazing",
                    "Great",
                    "Good",
                    "Nice",
                    "Brilliant"
               ],
               "responses": [
                    "Happy to help!",
                    "Any time!",
                    "My pleasure"
               ],
               "context": [
                    ""
               ]
          },
          {
               "tag": "zzunknow_query",
               "patterns": [
                    "boo",
                    "much time"
               ],
               "responses": [
                    "Sorry, I'm not able to understand your question. Can you please ask a different question?"
               ],
               "context": [
                    ""
               ]
          },
          {
               "tag": "Introduction",
               "patterns": [
                    "who am i talking",
                    "who",
                    "name",
                    "intro"
               ],
               "responses": [
                    "It's Bot-The Chatbot. I can give you information about <Strong>Mega Cloud</Strong> services on your kind demand.",
                    "I am Bot-The Chatbot. I can help you with querries regarding <Strong>Mega Cloud</Strong> services."
               ],
               "context": []
          },
          {
               "tag": "human",
               "patterns": [
                    "person",
                    "human",
                    "agent",
                    "representator",
                    "man"
               ],
               "responses": [
                    "Sorry, No human representatives are avaialble right now. You can ask me instead"
               ],
               "context": [
                    ""
               ]
          },
          {
               "tag": "ok",
               "patterns": [
                    "ok",
                    "okay",
                    "fine",
                    "right",
                    "yes",
                    "agreed"
               ],
               "responses": [
                    "Hope, I helped",
                    "Good to know you are satisfied with my services",
                    "Sure"
               ],
               "context": [
                    ""
               ]
          },
          {
               "tag": "chatbot",
               "patterns": [
                    "chatbot"
               ],
               "responses": [
                    "<br/>A chatbot is a software application used to conduct an on-line chat conversation via text or text-to-speech, in lieu of providing direct contact with a live human agent. "
               ],
               "context": []
          },
          {
               "tag": "afiniti_offer_chatbot",
               "patterns": [
                    "afiniti offer chatbot",
                    "afiniti hook chatbot",
                    "afiniti render chatbot",
                    "afiniti solicit chatbot",
                    "afiniti furnish chatbot",
                    "afiniti provide chatbot",
                    "afiniti accost chatbot",
                    "afiniti supply chatbot",
                    "afiniti offer chatbot"
               ],
               "responses": [
                    "<br/>Mega is currently developing a chatbot as part of MegaACD. "
               ],
               "context": []
          },
          {
               "tag": "mega_do_chatbot",
               "patterns": [
                    "mega do chatbot",
                    "mega overdo chatbot",
                    "mega make chatbot",
                    "mega exaggerate chatbot",
                    "mega do chatbot"
               ],
               "responses": [
                    "Mega chatbot is an AI-based chatbot that aims to lower the dependency on human agents by handling many of the everyday interactions that take place between customers and agents in a contact center setting. <br/><br/>With the help of Mega chatbot, our clients will be able to:<br/><br/>- Provide information about their products and services<br/>- Help customers make a better choice when shopping for products<br/>- Resolve problems that customers face in everyday use of their products and services. "
               ],
               "context": []
          },
          {
               "tag": "feature_mega_currently_available_chatbot",
               "patterns": [
                    "property mega currently available chatbot",
                    "badge mega currently available chatbot",
                    "peculiarity mega currently available chatbot",
                    "external mega currently available chatbot",
                    "centrepiece mega currently available chatbot",
                    "excellence mega currently available chatbot",
                    "magnet mega currently available chatbot",
                    "facet mega currently available chatbot",
                    "centerpiece mega currently available chatbot",
                    "dimension mega currently available chatbot",
                    "invariant mega currently available chatbot",
                    "aspect mega currently available chatbot",
                    "attribute mega currently available chatbot",
                    "contour mega currently available chatbot",
                    "attracter mega currently available chatbot",
                    "attractor mega currently available chatbot",
                    "attraction mega currently available chatbot",
                    "characteristic mega currently available chatbot",
                    "excellency mega currently available chatbot",
                    "feature mega currently available chatbot",
                    "feature mega presently available chatbot",
                    "feature mega currently acquirable chatbot",
                    "feature mega currently procurable chatbot",
                    "feature mega currently getable chatbot",
                    "feature mega currently handiness chatbot",
                    "feature mega currently forthcoming chatbot",
                    "feature mega currently accessible chatbot",
                    "feature mega currently visible chatbot",
                    "feature mega currently availableness chatbot",
                    "feature mega currently addressable chatbot",
                    "feature mega currently easy chatbot",
                    "feature mega currently lendable chatbot",
                    "feature mega currently ready chatbot",
                    "feature mega currently availability chatbot",
                    "feature mega currently purchasable chatbot",
                    "feature mega currently open chatbot",
                    "feature mega currently accessibility chatbot",
                    "feature mega currently obtainable chatbot",
                    "feature mega currently gettable chatbot",
                    "feature mega currently available chatbot"
               ],
               "responses": [
                    "Mega chatbot currently has following features:<br/><br/>- Ability to understand intent of users' input and respond with information based on the data provided to chatbot for training <br/>- A web interface provided to easily upload data for chatbot's training"
               ],
               "context": []
          },
          {
               "tag": "data_how_for_be_provided_training_can_chatbot",
               "patterns": [
                    "collection how for be provided training can chatbot",
                    "accumulation how for be provided training can chatbot",
                    "aggregation how for be provided training can chatbot",
                    "metadata how for be provided training can chatbot",
                    "information how for be provided training can chatbot",
                    "assemblage how for be provided training can chatbot",
                    "data hullo for be provided training can chatbot",
                    "data hi for be provided training can chatbot",
                    "data salutation for be provided training can chatbot",
                    "data howdy for be provided training can chatbot",
                    "data greeting for be provided training can chatbot",
                    "data hello for be provided training can chatbot",
                    "data how unwanted be provided training can chatbot",
                    "data how unwished be provided training can chatbot",
                    "data how unwelcome be provided training can chatbot",
                    "data how for act provided training can chatbot",
                    "data how for stagnate provided training can chatbot",
                    "data how for account provided training can chatbot",
                    "data how for buy provided training can chatbot",
                    "data how for mope provided training can chatbot",
                    "data how for need provided training can chatbot",
                    "data how for confound provided training can chatbot",
                    "data how for kill provided training can chatbot",
                    "data how for feel provided training can chatbot",
                    "data how for loiter provided training can chatbot",
                    "data how for relate provided training can chatbot",
                    "data how for suck provided training can chatbot",
                    "data how for hum provided training can chatbot",
                    "data how for befuddle provided training can chatbot",
                    "data how for hail provided training can chatbot",
                    "data how for compare provided training can chatbot",
                    "data how for yawn provided training can chatbot",
                    "data how for hang provided training can chatbot",
                    "data how for stay provided training can chatbot",
                    "data how for adorn provided training can chatbot",
                    "data how for specify provided training can chatbot",
                    "data how for incline provided training can chatbot",
                    "data how for curve provided training can chatbot",
                    "data how for incarnate provided training can chatbot",
                    "data how for bedevil provided training can chatbot",
                    "data how for translate provided training can chatbot",
                    "data how for number provided training can chatbot",
                    "data how for cover provided training can chatbot",
                    "data how for work provided training can chatbot",
                    "data how for iridesce provided training can chatbot",
                    "data how for hurt provided training can chatbot",
                    "data how for swim provided training can chatbot",
                    "data how for run provided training can chatbot",
                    "data how for suit provided training can chatbot",
                    "data how for hoodoo provided training can chatbot",
                    "data how for consist provided training can chatbot",
                    "data how for footle provided training can chatbot",
                    "data how for seethe provided training can chatbot",
                    "data how for cut provided training can chatbot",
                    "data how for deck provided training can chatbot",
                    "data how for suffer provided training can chatbot",
                    "data how for sparkle provided training can chatbot",
                    "data how for lallygag provided training can chatbot",
                    "data how for cohere provided training can chatbot",
                    "data how for owe provided training can chatbot",
                    "data how for balance provided training can chatbot",
                    "data how for represent provided training can chatbot",
                    "data how for seem provided training can chatbot",
                    "data how for distribute provided training can chatbot",
                    "data how for trim provided training can chatbot",
                    "data how for measure provided training can chatbot",
                    "data how for substantiate provided training can chatbot",
                    "data how for bake provided training can chatbot",
                    "data how for take provided training can chatbot",
                    "data how for point provided training can chatbot",
                    "data how for disaccord provided training can chatbot",
                    "data how for delimit provided training can chatbot",
                    "data how for define provided training can chatbot",
                    "data how for litter provided training can chatbot",
                    "data how for shine provided training can chatbot",
                    "data how for remain provided training can chatbot",
                    "data how for fox provided training can chatbot",
                    "data how for range provided training can chatbot",
                    "data how for lollygag provided training can chatbot",
                    "data how for squat provided training can chatbot",
                    "data how for grace provided training can chatbot",
                    "data how for twist provided training can chatbot",
                    "data how for beautify provided training can chatbot",
                    "data how for coruscate provided training can chatbot",
                    "data how for tarry provided training can chatbot",
                    "data how for stand provided training can chatbot",
                    "data how for loaf provided training can chatbot",
                    "data how for accept provided training can chatbot",
                    "data how for terminate provided training can chatbot",
                    "data how for scintillate provided training can chatbot",
                    "data how for retard provided training can chatbot",
                    "data how for gravitate provided training can chatbot",
                    "data how for end provided training can chatbot",
                    "data how for tend provided training can chatbot",
                    "data how for wash provided training can chatbot",
                    "data how for jumble provided training can chatbot",
                    "data how for beat provided training can chatbot",
                    "data how for lend provided training can chatbot",
                    "data how for yaw provided training can chatbot",
                    "data how for abound provided training can chatbot",
                    "data how for stick provided training can chatbot",
                    "data how for fuddle provided training can chatbot",
                    "data how for draw provided training can chatbot",
                    "data how for continue provided training can chatbot",
                    "data how for rut provided training can chatbot",
                    "data how for figure provided training can chatbot",
                    "data how for look provided training can chatbot",
                    "data how for transplant provided training can chatbot",
                    "data how for promise provided training can chatbot",
                    "data how for rage provided training can chatbot",
                    "data how for encounter provided training can chatbot",
                    "data how for decorate provided training can chatbot",
                    "data how for embellish provided training can chatbot",
                    "data how for broil provided training can chatbot",
                    "data how for buzz provided training can chatbot",
                    "data how for drown provided training can chatbot",
                    "data how for delineate provided training can chatbot",
                    "data how for contain provided training can chatbot",
                    "data how for gape provided training can chatbot",
                    "data how for make provided training can chatbot",
                    "data how for connect provided training can chatbot",
                    "data how for discord provided training can chatbot",
                    "data how for lurk provided training can chatbot",
                    "data how for hold provided training can chatbot",
                    "data how for compact provided training can chatbot",
                    "data how for delimitate provided training can chatbot",
                    "data how for boil provided training can chatbot",
                    "data how for amount provided training can chatbot",
                    "data how for press provided training can chatbot",
                    "data how for matter provided training can chatbot",
                    "data how for lubricate provided training can chatbot",
                    "data how for depend provided training can chatbot",
                    "data how for deserve provided training can chatbot",
                    "data how for osculate provided training can chatbot",
                    "data how for lie provided training can chatbot",
                    "data how for object provided training can chatbot",
                    "data how for rate provided training can chatbot",
                    "data how for pack provided training can chatbot",
                    "data how for lean provided training can chatbot",
                    "data how for throw provided training can chatbot",
                    "data how for confuse provided training can chatbot",
                    "data how for pay provided training can chatbot",
                    "data how for wind provided training can chatbot",
                    "data how for sell provided training can chatbot",
                    "data how for cost provided training can chatbot",
                    "data how for lounge provided training can chatbot",
                    "data how for require provided training can chatbot",
                    "data how for recognize provided training can chatbot",
                    "data how for enter provided training can chatbot",
                    "data how for comprise provided training can chatbot",
                    "data how for merit provided training can chatbot",
                    "data how for subtend provided training can chatbot",
                    "data how for swing provided training can chatbot",
                    "data how for test provided training can chatbot",
                    "data how for come provided training can chatbot",
                    "data how for embody provided training can chatbot",
                    "data how for go provided training can chatbot",
                    "data how for fall provided training can chatbot",
                    "data how for fit provided training can chatbot",
                    "data how for rest provided training can chatbot",
                    "data how for stink provided training can chatbot",
                    "data how for impend provided training can chatbot",
                    "data how for total provided training can chatbot",
                    "data how for start provided training can chatbot",
                    "data how for breathe provided training can chatbot",
                    "data how for rank provided training can chatbot",
                    "data how for prove provided training can chatbot",
                    "data how for count provided training can chatbot",
                    "data how for weigh provided training can chatbot",
                    "data how for disagree provided training can chatbot",
                    "data how for underlie provided training can chatbot",
                    "data how for appear provided training can chatbot",
                    "data how for clean provided training can chatbot",
                    "data how for interrelate provided training can chatbot",
                    "data how for begin provided training can chatbot",
                    "data how for answer provided training can chatbot",
                    "data how for belong provided training can chatbot",
                    "data how for linger provided training can chatbot",
                    "data how for head provided training can chatbot",
                    "data how for mingle provided training can chatbot",
                    "data how for discombobulate provided training can chatbot",
                    "data how for adhere provided training can chatbot",
                    "data how for want provided training can chatbot",
                    "data how for diverge provided training can chatbot",
                    "data how for be bed training can chatbot",
                    "data how for be cornice training can chatbot",
                    "data how for be terrasse training can chatbot",
                    "data how for be retrofit training can chatbot",
                    "data how for be rim training can chatbot",
                    "data how for be brattice training can chatbot",
                    "data how for be dado training can chatbot",
                    "data how for be pump training can chatbot",
                    "data how for be hydrate training can chatbot",
                    "data how for be corbel training can chatbot",
                    "data how for be joint training can chatbot",
                    "data how for be scant training can chatbot",
                    "data how for be wharf training can chatbot",
                    "data how for be match training can chatbot",
                    "data how for be tap training can chatbot",
                    "data how for be kern training can chatbot",
                    "data how for be oversupply training can chatbot",
                    "data how for be crenel training can chatbot",
                    "data how for be crenelate training can chatbot",
                    "data how for be surfeit training can chatbot",
                    "data how for be date training can chatbot",
                    "data how for be calk training can chatbot",
                    "data how for be canal training can chatbot",
                    "data how for be key training can chatbot",
                    "data how for be causeway training can chatbot",
                    "data how for be whisker training can chatbot",
                    "data how for be hobnail training can chatbot",
                    "data how for be extend training can chatbot",
                    "data how for be stock training can chatbot",
                    "data how for be reflectorise training can chatbot",
                    "data how for be yield training can chatbot",
                    "data how for be gate training can chatbot",
                    "data how for be air-cool training can chatbot",
                    "data how for be grate training can chatbot",
                    "data how for be cloy training can chatbot",
                    "data how for be afford training can chatbot",
                    "data how for be copper-bottom training can chatbot",
                    "data how for be sanitate training can chatbot",
                    "data how for be berth training can chatbot",
                    "data how for be terrace training can chatbot",
                    "data how for be feed training can chatbot",
                    "data how for be uniform training can chatbot",
                    "data how for be glaze training can chatbot",
                    "data how for be victual training can chatbot",
                    "data how for be border training can chatbot",
                    "data how for be step training can chatbot",
                    "data how for be capitalize training can chatbot",
                    "data how for be headline training can chatbot",
                    "data how for be seat training can chatbot",
                    "data how for be computerise training can chatbot",
                    "data how for be fuel training can chatbot",
                    "data how for be machicolate training can chatbot",
                    "data how for be toggle training can chatbot",
                    "data how for be signalise training can chatbot",
                    "data how for be curtain training can chatbot",
                    "data how for be canalise training can chatbot",
                    "data how for be caption training can chatbot",
                    "data how for be articulate training can chatbot",
                    "data how for be partner training can chatbot",
                    "data how for be alphabetize training can chatbot",
                    "data how for be canalize training can chatbot",
                    "data how for be pour training can chatbot",
                    "data how for be upholster training can chatbot",
                    "data how for be equip training can chatbot",
                    "data how for be transistorise training can chatbot",
                    "data how for be charge training can chatbot",
                    "data how for be shelter training can chatbot",
                    "data how for be provision training can chatbot",
                    "data how for be crenellate training can chatbot",
                    "data how for be rail training can chatbot",
                    "data how for be ticket training can chatbot",
                    "data how for be glass training can chatbot",
                    "data how for be hat training can chatbot",
                    "data how for be subtitle training can chatbot",
                    "data how for be render training can chatbot",
                    "data how for be theme training can chatbot",
                    "data how for be flood training can chatbot",
                    "data how for be air-condition training can chatbot",
                    "data how for be patch training can chatbot",
                    "data how for be cleat training can chatbot",
                    "data how for be signalize training can chatbot",
                    "data how for be innervate training can chatbot",
                    "data how for be costume training can chatbot",
                    "data how for be ramp training can chatbot",
                    "data how for be interleave training can chatbot",
                    "data how for be heat training can chatbot",
                    "data how for be fret training can chatbot",
                    "data how for be bush training can chatbot",
                    "data how for be stint training can chatbot",
                    "data how for be wive training can chatbot",
                    "data how for be index training can chatbot",
                    "data how for be fire training can chatbot",
                    "data how for be give training can chatbot",
                    "data how for be reflectorize training can chatbot",
                    "data how for be railroad training can chatbot",
                    "data how for be constitutionalize training can chatbot",
                    "data how for be outfit training can chatbot",
                    "data how for be top training can chatbot",
                    "data how for be purvey training can chatbot",
                    "data how for be glut training can chatbot",
                    "data how for be bewhisker training can chatbot",
                    "data how for be rafter training can chatbot",
                    "data how for be coal training can chatbot",
                    "data how for be skimp training can chatbot",
                    "data how for be computerize training can chatbot",
                    "data how for be leverage training can chatbot",
                    "data how for be headquarter training can chatbot",
                    "data how for be fit training can chatbot",
                    "data how for be fund training can chatbot",
                    "data how for be tube training can chatbot",
                    "data how for be furnish training can chatbot",
                    "data how for be bottom training can chatbot",
                    "data how for be offer training can chatbot",
                    "data how for be supply training can chatbot",
                    "data how for be transistorize training can chatbot",
                    "data how for be edge training can chatbot",
                    "data how for be water training can chatbot",
                    "data how for be capitalise training can chatbot",
                    "data how for be tool training can chatbot",
                    "data how for be slat training can chatbot",
                    "data how for be arm training can chatbot",
                    "data how for be provided activity can chatbot",
                    "data how for be provided drill can chatbot",
                    "data how for be provided retraining can chatbot",
                    "data how for be provided grooming can chatbot",
                    "data how for be provided exercise can chatbot",
                    "data how for be provided preparation can chatbot",
                    "data how for be provided schooling can chatbot",
                    "data how for be provided recitation can chatbot",
                    "data how for be provided practice can chatbot",
                    "data how for be provided discipline can chatbot",
                    "data how for be provided training tin chatbot",
                    "data how for be provided training keep chatbot",
                    "data how for be provided training preserve chatbot",
                    "data how for be provided training can chatbot"
               ],
               "responses": [
                    "<br/>A web interface has been provided where data (all possible questions and answers in an Excel file) can be uploaded easily for the chatbot to consume. "
               ],
               "context": []
          },
          {
               "tag": "how_asked_question_understand_respond_intent_chabot",
               "patterns": [
                    "hullo asked question understand respond intent chabot",
                    "hi asked question understand respond intent chabot",
                    "salutation asked question understand respond intent chabot",
                    "howdy asked question understand respond intent chabot",
                    "greeting asked question understand respond intent chabot",
                    "hello asked question understand respond intent chabot",
                    "how intercommunicate question understand respond intent chabot",
                    "how pry question understand respond intent chabot",
                    "how consult question understand respond intent chabot",
                    "how inquire question understand respond intent chabot",
                    "how enquire question understand respond intent chabot",
                    "how communicate question understand respond intent chabot",
                    "how asked inquiring understand respond intent chabot",
                    "how asked questioning understand respond intent chabot",
                    "how asked inquiry understand respond intent chabot",
                    "how asked enquiry understand respond intent chabot",
                    "how asked query understand respond intent chabot",
                    "how asked interrogation understand respond intent chabot",
                    "how asked question savvy respond intent chabot",
                    "how asked question interpret respond intent chabot",
                    "how asked question catch respond intent chabot",
                    "how asked question see respond intent chabot",
                    "how asked question compass respond intent chabot",
                    "how asked question read respond intent chabot",
                    "how asked question solve respond intent chabot",
                    "how asked question comprehend respond intent chabot",
                    "how asked question translate respond intent chabot",
                    "how asked question construe respond intent chabot",
                    "how asked question bottom respond intent chabot",
                    "how asked question work respond intent chabot",
                    "how asked question penetrate respond intent chabot",
                    "how asked question get respond intent chabot",
                    "how asked question touch respond intent chabot",
                    "how asked question fathom respond intent chabot",
                    "how asked question lick respond intent chabot",
                    "how asked question dig respond intent chabot",
                    "how asked question sense respond intent chabot",
                    "how asked question grasp respond intent chabot",
                    "how asked question grok respond intent chabot",
                    "how asked question apprehend respond intent chabot",
                    "how asked question follow respond intent chabot",
                    "how asked question understand greet intent chabot",
                    "how asked question understand resist intent chabot",
                    "how asked question understand act intent chabot",
                    "how asked question understand explode intent chabot",
                    "how asked question understand refuse intent chabot",
                    "how asked question understand react intent chabot",
                    "how asked question understand bristle intent chabot",
                    "how asked question understand consent intent chabot",
                    "how asked question understand decline intent chabot",
                    "how asked question understand flip intent chabot",
                    "how asked question understand stool intent chabot",
                    "how asked question understand notice intent chabot",
                    "how asked question understand reject intent chabot",
                    "how asked question understand treat intent chabot",
                    "how asked question understand marvel intent chabot",
                    "how asked question understand move intent chabot",
                    "how asked question understand accept intent chabot",
                    "how asked question understand wonder intent chabot",
                    "how asked question understand overreact intent chabot",
                    "how asked question understand answer intent chabot",
                    "how asked question understand acknowledge intent chabot",
                    "how asked question understand respond wrapped chabot",
                    "how asked question understand respond captive chabot",
                    "how asked question understand respond enwrapped chabot",
                    "how asked question understand respond engrossed chabot",
                    "how asked question understand respond absorbed chabot",
                    "how asked question understand respond attentive chabot",
                    "how asked question understand respond intent chabot"
               ],
               "responses": [
                    "<br/>Mega chatbot uses neural network and probability algorithm to identify the intent of the user input and present the most accurate response based on the training data. <br/><br/>When the chabot is provided data with any number of questions and their corresponding responses, it trains itself to learn all the questions and their responses. Once training is complete, when a user asks the chatbot a question, chatbot will identify the intent of the question asked by comparing it to the questions it was trained on using keywords and provide the most appropriate response."
               ],
               "context": []
          },
          {
               "tag": "data_how_be_chatbot_trained",
               "patterns": [
                    "collection how be chatbot trained",
                    "accumulation how be chatbot trained",
                    "aggregation how be chatbot trained",
                    "metadata how be chatbot trained",
                    "information how be chatbot trained",
                    "assemblage how be chatbot trained",
                    "data hullo be chatbot trained",
                    "data hi be chatbot trained",
                    "data salutation be chatbot trained",
                    "data howdy be chatbot trained",
                    "data greeting be chatbot trained",
                    "data hello be chatbot trained",
                    "data how act chatbot trained",
                    "data how stagnate chatbot trained",
                    "data how account chatbot trained",
                    "data how buy chatbot trained",
                    "data how mope chatbot trained",
                    "data how need chatbot trained",
                    "data how confound chatbot trained",
                    "data how kill chatbot trained",
                    "data how feel chatbot trained",
                    "data how loiter chatbot trained",
                    "data how relate chatbot trained",
                    "data how suck chatbot trained",
                    "data how hum chatbot trained",
                    "data how befuddle chatbot trained",
                    "data how hail chatbot trained",
                    "data how compare chatbot trained",
                    "data how yawn chatbot trained",
                    "data how hang chatbot trained",
                    "data how stay chatbot trained",
                    "data how adorn chatbot trained",
                    "data how specify chatbot trained",
                    "data how incline chatbot trained",
                    "data how curve chatbot trained",
                    "data how incarnate chatbot trained",
                    "data how bedevil chatbot trained",
                    "data how translate chatbot trained",
                    "data how number chatbot trained",
                    "data how cover chatbot trained",
                    "data how work chatbot trained",
                    "data how iridesce chatbot trained",
                    "data how hurt chatbot trained",
                    "data how swim chatbot trained",
                    "data how run chatbot trained",
                    "data how suit chatbot trained",
                    "data how hoodoo chatbot trained",
                    "data how consist chatbot trained",
                    "data how footle chatbot trained",
                    "data how seethe chatbot trained",
                    "data how cut chatbot trained",
                    "data how deck chatbot trained",
                    "data how suffer chatbot trained",
                    "data how sparkle chatbot trained",
                    "data how lallygag chatbot trained",
                    "data how cohere chatbot trained",
                    "data how owe chatbot trained",
                    "data how balance chatbot trained",
                    "data how represent chatbot trained",
                    "data how seem chatbot trained",
                    "data how distribute chatbot trained",
                    "data how trim chatbot trained",
                    "data how measure chatbot trained",
                    "data how substantiate chatbot trained",
                    "data how bake chatbot trained",
                    "data how take chatbot trained",
                    "data how point chatbot trained",
                    "data how disaccord chatbot trained",
                    "data how delimit chatbot trained",
                    "data how define chatbot trained",
                    "data how litter chatbot trained",
                    "data how shine chatbot trained",
                    "data how remain chatbot trained",
                    "data how fox chatbot trained",
                    "data how range chatbot trained",
                    "data how lollygag chatbot trained",
                    "data how squat chatbot trained",
                    "data how grace chatbot trained",
                    "data how twist chatbot trained",
                    "data how beautify chatbot trained",
                    "data how coruscate chatbot trained",
                    "data how tarry chatbot trained",
                    "data how stand chatbot trained",
                    "data how loaf chatbot trained",
                    "data how accept chatbot trained",
                    "data how terminate chatbot trained",
                    "data how scintillate chatbot trained",
                    "data how retard chatbot trained",
                    "data how gravitate chatbot trained",
                    "data how end chatbot trained",
                    "data how tend chatbot trained",
                    "data how wash chatbot trained",
                    "data how jumble chatbot trained",
                    "data how beat chatbot trained",
                    "data how lend chatbot trained",
                    "data how yaw chatbot trained",
                    "data how abound chatbot trained",
                    "data how stick chatbot trained",
                    "data how fuddle chatbot trained",
                    "data how draw chatbot trained",
                    "data how continue chatbot trained",
                    "data how rut chatbot trained",
                    "data how figure chatbot trained",
                    "data how look chatbot trained",
                    "data how transplant chatbot trained",
                    "data how promise chatbot trained",
                    "data how rage chatbot trained",
                    "data how encounter chatbot trained",
                    "data how decorate chatbot trained",
                    "data how embellish chatbot trained",
                    "data how broil chatbot trained",
                    "data how buzz chatbot trained",
                    "data how drown chatbot trained",
                    "data how delineate chatbot trained",
                    "data how contain chatbot trained",
                    "data how gape chatbot trained",
                    "data how make chatbot trained",
                    "data how connect chatbot trained",
                    "data how discord chatbot trained",
                    "data how lurk chatbot trained",
                    "data how hold chatbot trained",
                    "data how compact chatbot trained",
                    "data how delimitate chatbot trained",
                    "data how boil chatbot trained",
                    "data how amount chatbot trained",
                    "data how press chatbot trained",
                    "data how matter chatbot trained",
                    "data how lubricate chatbot trained",
                    "data how depend chatbot trained",
                    "data how deserve chatbot trained",
                    "data how osculate chatbot trained",
                    "data how lie chatbot trained",
                    "data how object chatbot trained",
                    "data how rate chatbot trained",
                    "data how pack chatbot trained",
                    "data how lean chatbot trained",
                    "data how throw chatbot trained",
                    "data how confuse chatbot trained",
                    "data how pay chatbot trained",
                    "data how wind chatbot trained",
                    "data how sell chatbot trained",
                    "data how cost chatbot trained",
                    "data how lounge chatbot trained",
                    "data how require chatbot trained",
                    "data how recognize chatbot trained",
                    "data how enter chatbot trained",
                    "data how comprise chatbot trained",
                    "data how merit chatbot trained",
                    "data how subtend chatbot trained",
                    "data how swing chatbot trained",
                    "data how test chatbot trained",
                    "data how come chatbot trained",
                    "data how embody chatbot trained",
                    "data how go chatbot trained",
                    "data how fall chatbot trained",
                    "data how fit chatbot trained",
                    "data how rest chatbot trained",
                    "data how stink chatbot trained",
                    "data how impend chatbot trained",
                    "data how total chatbot trained",
                    "data how start chatbot trained",
                    "data how breathe chatbot trained",
                    "data how rank chatbot trained",
                    "data how prove chatbot trained",
                    "data how count chatbot trained",
                    "data how weigh chatbot trained",
                    "data how disagree chatbot trained",
                    "data how underlie chatbot trained",
                    "data how appear chatbot trained",
                    "data how clean chatbot trained",
                    "data how interrelate chatbot trained",
                    "data how begin chatbot trained",
                    "data how answer chatbot trained",
                    "data how belong chatbot trained",
                    "data how linger chatbot trained",
                    "data how head chatbot trained",
                    "data how mingle chatbot trained",
                    "data how discombobulate chatbot trained",
                    "data how adhere chatbot trained",
                    "data how want chatbot trained",
                    "data how diverge chatbot trained",
                    "data how be chatbot trained",
                    "data how be chatbot drilled",
                    "data how be chatbot pot-trained",
                    "data how be chatbot disciplined",
                    "data how be chatbot toilet-trained",
                    "data how be chatbot potty-trained",
                    "data how be chatbot house-trained",
                    "data how be chatbot housebroken"
               ],
               "responses": [
                    "<br/>A web interface has been provided on which data (in Excel files) can be uploaded. Once the upload is complete, chatbot will pick up the file and begin the training process."
               ],
               "context": []
          },
          {
               "tag": "training_during_happens_process",
               "patterns": [
                    "activity during happens process",
                    "drill during happens process",
                    "retraining during happens process",
                    "grooming during happens process",
                    "exercise during happens process",
                    "preparation during happens process",
                    "schooling during happens process",
                    "recitation during happens process",
                    "practice during happens process",
                    "discipline during happens process",
                    "training during happens process",
                    "training during break process",
                    "training during coincide process",
                    "training during materialize process",
                    "training during backfire process",
                    "training during backlash process",
                    "training during pass process",
                    "training during recoil process",
                    "training during befall process",
                    "training during come process",
                    "training during supervene process",
                    "training during go process",
                    "training during fall process",
                    "training during contemporize process",
                    "training during operate process",
                    "training during shine process",
                    "training during repeat process",
                    "training during synchronise process",
                    "training during chance process",
                    "training during anticipate process",
                    "training during intervene process",
                    "training during synchronize process",
                    "training during occur process",
                    "training during bechance process",
                    "training during transpire process",
                    "training during recrudesce process",
                    "training during materialise process",
                    "training during concur process",
                    "training during give process",
                    "training during result process",
                    "training during contemporise process",
                    "training during betide process",
                    "training during recur process",
                    "training during hap process",
                    "training during proceed process",
                    "training during arise process",
                    "training during strike process",
                    "training during develop process",
                    "training during happens procedure",
                    "training during happens rule",
                    "training during happens formula",
                    "training during happens calculation",
                    "training during happens condition",
                    "training during happens indirection",
                    "training during happens routine",
                    "training during happens activity",
                    "training during happens rigmarole",
                    "training during happens computation",
                    "training during happens rigamarole",
                    "training during happens stiffening",
                    "training during happens computing",
                    "training during happens mapping",
                    "training during happens fingerprinting"
               ],
               "responses": [
                    "<br/>When the chatbot trains, it reads through all the questions provided in the data, identifies keywords and looks up their synonyms. It then uses the frequency of the key words in the questions and their synonyms to associate them to responses provided in data. This enables chatbot to understand questions that asked are differently from the data questions and respond to them."
               ],
               "context": []
          },
          {
               "tag": "on_happen_but_related_it_wa_asked_question_that_not_understand_chatbot_trained",
               "patterns": [
                    "along happen but related it wa asked question that not understand chatbot trained",
                    "on break but related it wa asked question that not understand chatbot trained",
                    "on coincide but related it wa asked question that not understand chatbot trained",
                    "on materialize but related it wa asked question that not understand chatbot trained",
                    "on backfire but related it wa asked question that not understand chatbot trained",
                    "on backlash but related it wa asked question that not understand chatbot trained",
                    "on pass but related it wa asked question that not understand chatbot trained",
                    "on recoil but related it wa asked question that not understand chatbot trained",
                    "on befall but related it wa asked question that not understand chatbot trained",
                    "on come but related it wa asked question that not understand chatbot trained",
                    "on supervene but related it wa asked question that not understand chatbot trained",
                    "on go but related it wa asked question that not understand chatbot trained",
                    "on fall but related it wa asked question that not understand chatbot trained",
                    "on contemporize but related it wa asked question that not understand chatbot trained",
                    "on operate but related it wa asked question that not understand chatbot trained",
                    "on shine but related it wa asked question that not understand chatbot trained",
                    "on repeat but related it wa asked question that not understand chatbot trained",
                    "on synchronise but related it wa asked question that not understand chatbot trained",
                    "on chance but related it wa asked question that not understand chatbot trained",
                    "on anticipate but related it wa asked question that not understand chatbot trained",
                    "on intervene but related it wa asked question that not understand chatbot trained",
                    "on synchronize but related it wa asked question that not understand chatbot trained",
                    "on occur but related it wa asked question that not understand chatbot trained",
                    "on bechance but related it wa asked question that not understand chatbot trained",
                    "on transpire but related it wa asked question that not understand chatbot trained",
                    "on recrudesce but related it wa asked question that not understand chatbot trained",
                    "on materialise but related it wa asked question that not understand chatbot trained",
                    "on concur but related it wa asked question that not understand chatbot trained",
                    "on give but related it wa asked question that not understand chatbot trained",
                    "on result but related it wa asked question that not understand chatbot trained",
                    "on contemporise but related it wa asked question that not understand chatbot trained",
                    "on betide but related it wa asked question that not understand chatbot trained",
                    "on recur but related it wa asked question that not understand chatbot trained",
                    "on hap but related it wa asked question that not understand chatbot trained",
                    "on proceed but related it wa asked question that not understand chatbot trained",
                    "on arise but related it wa asked question that not understand chatbot trained",
                    "on strike but related it wa asked question that not understand chatbot trained",
                    "on develop but related it wa asked question that not understand chatbot trained",
                    "on happen only related it wa asked question that not understand chatbot trained",
                    "on happen just related it wa asked question that not understand chatbot trained",
                    "on happen merely related it wa asked question that not understand chatbot trained",
                    "on happen simply related it wa asked question that not understand chatbot trained",
                    "on happen but age-related it wa asked question that not understand chatbot trained",
                    "on happen but connected it wa asked question that not understand chatbot trained",
                    "on happen but correlative it wa asked question that not understand chatbot trained",
                    "on happen but corresponding it wa asked question that not understand chatbot trained",
                    "on happen but correlate it wa asked question that not understand chatbot trained",
                    "on happen but correlated it wa asked question that not understand chatbot trained",
                    "on happen but connate it wa asked question that not understand chatbot trained",
                    "on happen but attached it wa asked question that not understand chatbot trained",
                    "on happen but coreferent it wa asked question that not understand chatbot trained",
                    "on happen but affiliated it wa asked question that not understand chatbot trained",
                    "on happen but cognate it wa asked question that not understand chatbot trained",
                    "on happen but related engineering wa asked question that not understand chatbot trained",
                    "on happen but related technology wa asked question that not understand chatbot trained",
                    "on happen but related it Aberdeen asked question that not understand chatbot trained",
                    "on happen but related it U.S.A. asked question that not understand chatbot trained",
                    "on happen but related it Yakima asked question that not understand chatbot trained",
                    "on happen but related it Bellingham asked question that not understand chatbot trained",
                    "on happen but related it Seattle asked question that not understand chatbot trained",
                    "on happen but related it US asked question that not understand chatbot trained",
                    "on happen but related it Olympia asked question that not understand chatbot trained",
                    "on happen but related it Vancouver asked question that not understand chatbot trained",
                    "on happen but related it USA asked question that not understand chatbot trained",
                    "on happen but related it Snake asked question that not understand chatbot trained",
                    "on happen but related it U.S. asked question that not understand chatbot trained",
                    "on happen but related it Washington asked question that not understand chatbot trained",
                    "on happen but related it Columbia asked question that not understand chatbot trained",
                    "on happen but related it America asked question that not understand chatbot trained",
                    "on happen but related it Kennewick asked question that not understand chatbot trained",
                    "on happen but related it Adams asked question that not understand chatbot trained",
                    "on happen but related it scablands asked question that not understand chatbot trained",
                    "on happen but related it Spokane asked question that not understand chatbot trained",
                    "on happen but related it Ranier asked question that not understand chatbot trained",
                    "on happen but related it Tacoma asked question that not understand chatbot trained",
                    "on happen but related it wa intercommunicate question that not understand chatbot trained",
                    "on happen but related it wa pry question that not understand chatbot trained",
                    "on happen but related it wa consult question that not understand chatbot trained",
                    "on happen but related it wa inquire question that not understand chatbot trained",
                    "on happen but related it wa enquire question that not understand chatbot trained",
                    "on happen but related it wa communicate question that not understand chatbot trained",
                    "on happen but related it wa asked inquiring that not understand chatbot trained",
                    "on happen but related it wa asked questioning that not understand chatbot trained",
                    "on happen but related it wa asked inquiry that not understand chatbot trained",
                    "on happen but related it wa asked enquiry that not understand chatbot trained",
                    "on happen but related it wa asked query that not understand chatbot trained",
                    "on happen but related it wa asked interrogation that not understand chatbot trained",
                    "on happen but related it wa asked question that not understand chatbot trained",
                    "on happen but related it wa asked question that non understand chatbot trained",
                    "on happen but related it wa asked question that not savvy chatbot trained",
                    "on happen but related it wa asked question that not interpret chatbot trained",
                    "on happen but related it wa asked question that not catch chatbot trained",
                    "on happen but related it wa asked question that not see chatbot trained",
                    "on happen but related it wa asked question that not compass chatbot trained",
                    "on happen but related it wa asked question that not read chatbot trained",
                    "on happen but related it wa asked question that not solve chatbot trained",
                    "on happen but related it wa asked question that not comprehend chatbot trained",
                    "on happen but related it wa asked question that not translate chatbot trained",
                    "on happen but related it wa asked question that not construe chatbot trained",
                    "on happen but related it wa asked question that not bottom chatbot trained",
                    "on happen but related it wa asked question that not work chatbot trained",
                    "on happen but related it wa asked question that not penetrate chatbot trained",
                    "on happen but related it wa asked question that not get chatbot trained",
                    "on happen but related it wa asked question that not touch chatbot trained",
                    "on happen but related it wa asked question that not fathom chatbot trained",
                    "on happen but related it wa asked question that not lick chatbot trained",
                    "on happen but related it wa asked question that not dig chatbot trained",
                    "on happen but related it wa asked question that not sense chatbot trained",
                    "on happen but related it wa asked question that not grasp chatbot trained",
                    "on happen but related it wa asked question that not grok chatbot trained",
                    "on happen but related it wa asked question that not apprehend chatbot trained",
                    "on happen but related it wa asked question that not follow chatbot trained",
                    "on happen but related it wa asked question that not understand chatbot trained",
                    "on happen but related it wa asked question that not understand chatbot drilled",
                    "on happen but related it wa asked question that not understand chatbot pot-trained",
                    "on happen but related it wa asked question that not understand chatbot disciplined",
                    "on happen but related it wa asked question that not understand chatbot toilet-trained",
                    "on happen but related it wa asked question that not understand chatbot potty-trained",
                    "on happen but related it wa asked question that not understand chatbot house-trained",
                    "on happen but related it wa asked question that not understand chatbot housebroken"
               ],
               "responses": [
                    "<br/>It is possible that the chatbot is asked a question that it does not undertand even though it was trained on a question that was worded/phrased differently but had the same meaning. In this case it will respond by saying \"Sorry, I do not understad the question. Can you please try saying it a different way?\" to get the user to ask the question differently. "
               ],
               "context": []
          },
          {
               "tag": "on_happen_it_wa_asked_question_not_chatbot_trained",
               "patterns": [
                    "along happen it wa asked question not chatbot trained",
                    "on break it wa asked question not chatbot trained",
                    "on coincide it wa asked question not chatbot trained",
                    "on materialize it wa asked question not chatbot trained",
                    "on backfire it wa asked question not chatbot trained",
                    "on backlash it wa asked question not chatbot trained",
                    "on pass it wa asked question not chatbot trained",
                    "on recoil it wa asked question not chatbot trained",
                    "on befall it wa asked question not chatbot trained",
                    "on come it wa asked question not chatbot trained",
                    "on supervene it wa asked question not chatbot trained",
                    "on go it wa asked question not chatbot trained",
                    "on fall it wa asked question not chatbot trained",
                    "on contemporize it wa asked question not chatbot trained",
                    "on operate it wa asked question not chatbot trained",
                    "on shine it wa asked question not chatbot trained",
                    "on repeat it wa asked question not chatbot trained",
                    "on synchronise it wa asked question not chatbot trained",
                    "on chance it wa asked question not chatbot trained",
                    "on anticipate it wa asked question not chatbot trained",
                    "on intervene it wa asked question not chatbot trained",
                    "on synchronize it wa asked question not chatbot trained",
                    "on occur it wa asked question not chatbot trained",
                    "on bechance it wa asked question not chatbot trained",
                    "on transpire it wa asked question not chatbot trained",
                    "on recrudesce it wa asked question not chatbot trained",
                    "on materialise it wa asked question not chatbot trained",
                    "on concur it wa asked question not chatbot trained",
                    "on give it wa asked question not chatbot trained",
                    "on result it wa asked question not chatbot trained",
                    "on contemporise it wa asked question not chatbot trained",
                    "on betide it wa asked question not chatbot trained",
                    "on recur it wa asked question not chatbot trained",
                    "on hap it wa asked question not chatbot trained",
                    "on proceed it wa asked question not chatbot trained",
                    "on arise it wa asked question not chatbot trained",
                    "on strike it wa asked question not chatbot trained",
                    "on develop it wa asked question not chatbot trained",
                    "on happen engineering wa asked question not chatbot trained",
                    "on happen technology wa asked question not chatbot trained",
                    "on happen it Aberdeen asked question not chatbot trained",
                    "on happen it U.S.A. asked question not chatbot trained",
                    "on happen it Yakima asked question not chatbot trained",
                    "on happen it Bellingham asked question not chatbot trained",
                    "on happen it Seattle asked question not chatbot trained",
                    "on happen it US asked question not chatbot trained",
                    "on happen it Olympia asked question not chatbot trained",
                    "on happen it Vancouver asked question not chatbot trained",
                    "on happen it USA asked question not chatbot trained",
                    "on happen it Snake asked question not chatbot trained",
                    "on happen it U.S. asked question not chatbot trained",
                    "on happen it Washington asked question not chatbot trained",
                    "on happen it Columbia asked question not chatbot trained",
                    "on happen it America asked question not chatbot trained",
                    "on happen it Kennewick asked question not chatbot trained",
                    "on happen it Adams asked question not chatbot trained",
                    "on happen it scablands asked question not chatbot trained",
                    "on happen it Spokane asked question not chatbot trained",
                    "on happen it Ranier asked question not chatbot trained",
                    "on happen it Tacoma asked question not chatbot trained",
                    "on happen it wa intercommunicate question not chatbot trained",
                    "on happen it wa pry question not chatbot trained",
                    "on happen it wa consult question not chatbot trained",
                    "on happen it wa inquire question not chatbot trained",
                    "on happen it wa enquire question not chatbot trained",
                    "on happen it wa communicate question not chatbot trained",
                    "on happen it wa asked inquiring not chatbot trained",
                    "on happen it wa asked questioning not chatbot trained",
                    "on happen it wa asked inquiry not chatbot trained",
                    "on happen it wa asked enquiry not chatbot trained",
                    "on happen it wa asked query not chatbot trained",
                    "on happen it wa asked interrogation not chatbot trained",
                    "on happen it wa asked question non chatbot trained",
                    "on happen it wa asked question not chatbot trained",
                    "on happen it wa asked question not chatbot drilled",
                    "on happen it wa asked question not chatbot pot-trained",
                    "on happen it wa asked question not chatbot disciplined",
                    "on happen it wa asked question not chatbot toilet-trained",
                    "on happen it wa asked question not chatbot potty-trained",
                    "on happen it wa asked question not chatbot house-trained",
                    "on happen it wa asked question not chatbot housebroken"
               ],
               "responses": [
                    "<br/>In this case the chatbot will respond by saying \"Sorry, I do not understad the question. Can you please try saying it a different way?\". Since the chatbot would not have a reponse for this question, currently it will keep repeating the same response.<br/><br/>However, eventually a feature will be added to the chatbot where the chatbot will connect user to a human agent if it does not have a response to a user input. "
               ],
               "context": []
          },
          {
               "tag": "limitation_current_chatbot",
               "patterns": [
                    "disadvantage current chatbot",
                    "limitation on-line chatbot",
                    "limitation incumbent chatbot",
                    "limitation up-to-the-minute chatbot",
                    "limitation new chatbot",
                    "limitation online chatbot",
                    "limitation topical chatbot",
                    "limitation modern chatbot",
                    "limitation live chatbot",
                    "limitation up-to-dateness chatbot",
                    "limitation underway chatbot",
                    "limitation on-going chatbot",
                    "limitation afoot chatbot",
                    "limitation ongoing chatbot",
                    "limitation currency chatbot",
                    "limitation circulating chatbot",
                    "limitation occurrent chatbot",
                    "limitation contemporary chatbot",
                    "limitation currentness chatbot",
                    "limitation up-to-date chatbot",
                    "limitation actual chatbot",
                    "limitation present-day chatbot",
                    "limitation latest chatbot",
                    "limitation current chatbot"
               ],
               "responses": [
                    "Mega chatbot currently has the following limitations:<br/><br/>- It is not self-learning and data has to be provided manually via a web interface<br/>- It can only respond to questions that have been provided in the training data <br/>- It treats each question asked as a separate question and does not understand the context in which they are being asked. It is therefore not able to have a back and forth conversation on a specific topic<br/>- It is not able to access to customer data and therefore cannot provide support specific to individual customers<br/>- It cannot connect user to a human agent"
               ],
               "context": []
          },
          {
               "tag": "chatbot_feature_be_available_planned_future",
               "patterns": [
                    "chatbot feature be available planned future",
                    "chatbot property be available planned future",
                    "chatbot badge be available planned future",
                    "chatbot peculiarity be available planned future",
                    "chatbot external be available planned future",
                    "chatbot centrepiece be available planned future",
                    "chatbot excellence be available planned future",
                    "chatbot magnet be available planned future",
                    "chatbot facet be available planned future",
                    "chatbot centerpiece be available planned future",
                    "chatbot dimension be available planned future",
                    "chatbot invariant be available planned future",
                    "chatbot aspect be available planned future",
                    "chatbot attribute be available planned future",
                    "chatbot contour be available planned future",
                    "chatbot attracter be available planned future",
                    "chatbot attractor be available planned future",
                    "chatbot attraction be available planned future",
                    "chatbot characteristic be available planned future",
                    "chatbot excellency be available planned future",
                    "chatbot feature act available planned future",
                    "chatbot feature stagnate available planned future",
                    "chatbot feature account available planned future",
                    "chatbot feature buy available planned future",
                    "chatbot feature mope available planned future",
                    "chatbot feature need available planned future",
                    "chatbot feature confound available planned future",
                    "chatbot feature kill available planned future",
                    "chatbot feature feel available planned future",
                    "chatbot feature loiter available planned future",
                    "chatbot feature relate available planned future",
                    "chatbot feature suck available planned future",
                    "chatbot feature hum available planned future",
                    "chatbot feature befuddle available planned future",
                    "chatbot feature hail available planned future",
                    "chatbot feature compare available planned future",
                    "chatbot feature yawn available planned future",
                    "chatbot feature hang available planned future",
                    "chatbot feature stay available planned future",
                    "chatbot feature adorn available planned future",
                    "chatbot feature specify available planned future",
                    "chatbot feature incline available planned future",
                    "chatbot feature curve available planned future",
                    "chatbot feature incarnate available planned future",
                    "chatbot feature bedevil available planned future",
                    "chatbot feature translate available planned future",
                    "chatbot feature number available planned future",
                    "chatbot feature cover available planned future",
                    "chatbot feature work available planned future",
                    "chatbot feature iridesce available planned future",
                    "chatbot feature hurt available planned future",
                    "chatbot feature swim available planned future",
                    "chatbot feature run available planned future",
                    "chatbot feature suit available planned future",
                    "chatbot feature hoodoo available planned future",
                    "chatbot feature consist available planned future",
                    "chatbot feature footle available planned future",
                    "chatbot feature seethe available planned future",
                    "chatbot feature cut available planned future",
                    "chatbot feature deck available planned future",
                    "chatbot feature suffer available planned future",
                    "chatbot feature sparkle available planned future",
                    "chatbot feature lallygag available planned future",
                    "chatbot feature cohere available planned future",
                    "chatbot feature owe available planned future",
                    "chatbot feature balance available planned future",
                    "chatbot feature represent available planned future",
                    "chatbot feature seem available planned future",
                    "chatbot feature distribute available planned future",
                    "chatbot feature trim available planned future",
                    "chatbot feature measure available planned future",
                    "chatbot feature substantiate available planned future",
                    "chatbot feature bake available planned future",
                    "chatbot feature take available planned future",
                    "chatbot feature point available planned future",
                    "chatbot feature disaccord available planned future",
                    "chatbot feature delimit available planned future",
                    "chatbot feature define available planned future",
                    "chatbot feature litter available planned future",
                    "chatbot feature shine available planned future",
                    "chatbot feature remain available planned future",
                    "chatbot feature fox available planned future",
                    "chatbot feature range available planned future",
                    "chatbot feature lollygag available planned future",
                    "chatbot feature squat available planned future",
                    "chatbot feature grace available planned future",
                    "chatbot feature twist available planned future",
                    "chatbot feature beautify available planned future",
                    "chatbot feature coruscate available planned future",
                    "chatbot feature tarry available planned future",
                    "chatbot feature stand available planned future",
                    "chatbot feature loaf available planned future",
                    "chatbot feature accept available planned future",
                    "chatbot feature terminate available planned future",
                    "chatbot feature scintillate available planned future",
                    "chatbot feature retard available planned future",
                    "chatbot feature gravitate available planned future",
                    "chatbot feature end available planned future",
                    "chatbot feature tend available planned future",
                    "chatbot feature wash available planned future",
                    "chatbot feature jumble available planned future",
                    "chatbot feature beat available planned future",
                    "chatbot feature lend available planned future",
                    "chatbot feature yaw available planned future",
                    "chatbot feature abound available planned future",
                    "chatbot feature stick available planned future",
                    "chatbot feature fuddle available planned future",
                    "chatbot feature draw available planned future",
                    "chatbot feature continue available planned future",
                    "chatbot feature rut available planned future",
                    "chatbot feature figure available planned future",
                    "chatbot feature look available planned future",
                    "chatbot feature transplant available planned future",
                    "chatbot feature promise available planned future",
                    "chatbot feature rage available planned future",
                    "chatbot feature encounter available planned future",
                    "chatbot feature decorate available planned future",
                    "chatbot feature embellish available planned future",
                    "chatbot feature broil available planned future",
                    "chatbot feature buzz available planned future",
                    "chatbot feature drown available planned future",
                    "chatbot feature delineate available planned future",
                    "chatbot feature contain available planned future",
                    "chatbot feature gape available planned future",
                    "chatbot feature make available planned future",
                    "chatbot feature connect available planned future",
                    "chatbot feature discord available planned future",
                    "chatbot feature lurk available planned future",
                    "chatbot feature hold available planned future",
                    "chatbot feature compact available planned future",
                    "chatbot feature delimitate available planned future",
                    "chatbot feature boil available planned future",
                    "chatbot feature amount available planned future",
                    "chatbot feature press available planned future",
                    "chatbot feature matter available planned future",
                    "chatbot feature lubricate available planned future",
                    "chatbot feature depend available planned future",
                    "chatbot feature deserve available planned future",
                    "chatbot feature osculate available planned future",
                    "chatbot feature lie available planned future",
                    "chatbot feature object available planned future",
                    "chatbot feature rate available planned future",
                    "chatbot feature pack available planned future",
                    "chatbot feature lean available planned future",
                    "chatbot feature throw available planned future",
                    "chatbot feature confuse available planned future",
                    "chatbot feature pay available planned future",
                    "chatbot feature wind available planned future",
                    "chatbot feature sell available planned future",
                    "chatbot feature cost available planned future",
                    "chatbot feature lounge available planned future",
                    "chatbot feature require available planned future",
                    "chatbot feature recognize available planned future",
                    "chatbot feature enter available planned future",
                    "chatbot feature comprise available planned future",
                    "chatbot feature merit available planned future",
                    "chatbot feature subtend available planned future",
                    "chatbot feature swing available planned future",
                    "chatbot feature test available planned future",
                    "chatbot feature come available planned future",
                    "chatbot feature embody available planned future",
                    "chatbot feature go available planned future",
                    "chatbot feature fall available planned future",
                    "chatbot feature fit available planned future",
                    "chatbot feature rest available planned future",
                    "chatbot feature stink available planned future",
                    "chatbot feature impend available planned future",
                    "chatbot feature total available planned future",
                    "chatbot feature start available planned future",
                    "chatbot feature breathe available planned future",
                    "chatbot feature rank available planned future",
                    "chatbot feature prove available planned future",
                    "chatbot feature count available planned future",
                    "chatbot feature weigh available planned future",
                    "chatbot feature disagree available planned future",
                    "chatbot feature underlie available planned future",
                    "chatbot feature appear available planned future",
                    "chatbot feature clean available planned future",
                    "chatbot feature interrelate available planned future",
                    "chatbot feature begin available planned future",
                    "chatbot feature answer available planned future",
                    "chatbot feature belong available planned future",
                    "chatbot feature linger available planned future",
                    "chatbot feature head available planned future",
                    "chatbot feature mingle available planned future",
                    "chatbot feature discombobulate available planned future",
                    "chatbot feature adhere available planned future",
                    "chatbot feature want available planned future",
                    "chatbot feature diverge available planned future",
                    "chatbot feature be acquirable planned future",
                    "chatbot feature be procurable planned future",
                    "chatbot feature be getable planned future",
                    "chatbot feature be handiness planned future",
                    "chatbot feature be forthcoming planned future",
                    "chatbot feature be accessible planned future",
                    "chatbot feature be visible planned future",
                    "chatbot feature be availableness planned future",
                    "chatbot feature be addressable planned future",
                    "chatbot feature be easy planned future",
                    "chatbot feature be lendable planned future",
                    "chatbot feature be ready planned future",
                    "chatbot feature be availability planned future",
                    "chatbot feature be purchasable planned future",
                    "chatbot feature be open planned future",
                    "chatbot feature be accessibility planned future",
                    "chatbot feature be obtainable planned future",
                    "chatbot feature be gettable planned future",
                    "chatbot feature be available contrived future",
                    "chatbot feature be available premeditated future",
                    "chatbot feature be available intended future",
                    "chatbot feature be available predetermined future",
                    "chatbot feature be available deep-laid future",
                    "chatbot feature be available preset future",
                    "chatbot feature be available put-up future",
                    "chatbot feature be available planned by-and-by",
                    "chatbot feature be available planned time",
                    "chatbot feature be available planned futurity",
                    "chatbot feature be available planned manana",
                    "chatbot feature be available planned tomorrow",
                    "chatbot feature be available planned hereafter",
                    "chatbot feature be available planned offing"
               ],
               "responses": [
                    "<br/>Mega chatbot will have the following features:<br/><br/>- Use neural network and deep learning to understand the context of customers' queries in addition to the intent of individual questions<br/>- Ability to access customer data through CRM and billing systems after they log in, to identify products used and their history with the company<br/>- Provide customer an option (through a GUI button or text input) to speak to a human agent at any point in the chat<br/>- Ability to monitor real-time chat between human agents and customers and use the chat as data to train itself. This will enhance its capability to better interact with customers<br/>- Calculate the probability of being able to respond accurately to all customer inputs and only respond if probability is high. A low probability calculation will lead to customer being connected to a human agent without a response from chatbot. This feature will help maintain good customer experience when using chatbot."
               ],
               "context": []
          },
          {
               "tag": "neural_deep_learning_chatbot_mega_using_benefit_purpose_network",
               "patterns": [
                    "neuronic deep learning chatbot mega using benefit purpose network",
                    "neuronal deep learning chatbot mega using benefit purpose network",
                    "neural heavy learning chatbot mega using benefit purpose network",
                    "neural deepness learning chatbot mega using benefit purpose network",
                    "neural profound learning chatbot mega using benefit purpose network",
                    "neural depth learning chatbot mega using benefit purpose network",
                    "neural sound learning chatbot mega using benefit purpose network",
                    "neural wakeless learning chatbot mega using benefit purpose network",
                    "neural deep imprinting chatbot mega using benefit purpose network",
                    "neural deep memorization chatbot mega using benefit purpose network",
                    "neural deep internalization chatbot mega using benefit purpose network",
                    "neural deep transfer chatbot mega using benefit purpose network",
                    "neural deep carry-over chatbot mega using benefit purpose network",
                    "neural deep study chatbot mega using benefit purpose network",
                    "neural deep work chatbot mega using benefit purpose network",
                    "neural deep acquisition chatbot mega using benefit purpose network",
                    "neural deep internalisation chatbot mega using benefit purpose network",
                    "neural deep memorisation chatbot mega using benefit purpose network",
                    "neural deep incorporation chatbot mega using benefit purpose network",
                    "neural deep digestion chatbot mega using benefit purpose network",
                    "neural deep education chatbot mega using benefit purpose network",
                    "neural deep conditioning chatbot mega using benefit purpose network",
                    "neural deep learning chatbot mega using benefit purpose network",
                    "neural deep learning chatbot mega using benefit purpose network",
                    "neural deep learning chatbot mega victimisation benefit purpose network",
                    "neural deep learning chatbot mega blaxploitation benefit purpose network",
                    "neural deep learning chatbot mega victimization benefit purpose network",
                    "neural deep learning chatbot mega mistreatment benefit purpose network",
                    "neural deep learning chatbot mega sexploitation benefit purpose network",
                    "neural deep learning chatbot mega colonialism benefit purpose network",
                    "neural deep learning chatbot mega exploitation benefit purpose network",
                    "neural deep learning chatbot mega using payment purpose network",
                    "neural deep learning chatbot mega using perquisite purpose network",
                    "neural deep learning chatbot mega using perk purpose network",
                    "neural deep learning chatbot mega using benefit mind network",
                    "neural deep learning chatbot mega using benefit sake network",
                    "neural deep learning chatbot mega using benefit goal network",
                    "neural deep learning chatbot mega using benefit intention network",
                    "neural deep learning chatbot mega using benefit end network",
                    "neural deep learning chatbot mega using benefit will network",
                    "neural deep learning chatbot mega using benefit cross-purpose network",
                    "neural deep learning chatbot mega using benefit view network",
                    "neural deep learning chatbot mega using benefit aim network",
                    "neural deep learning chatbot mega using benefit design network",
                    "neural deep learning chatbot mega using benefit intent network",
                    "neural deep learning chatbot mega using benefit idea network",
                    "neural deep learning chatbot mega using benefit purpose reticulum",
                    "neural deep learning chatbot mega using benefit purpose scheme",
                    "neural deep learning chatbot mega using benefit purpose system",
                    "neural deep learning chatbot mega using benefit purpose web"
               ],
               "responses": [
                    "<br/>Using neural network and deep learning will enable Mega chatbot to understand the intent of user's input and the context of the conversation. This will enable the chatbot to:<br/><br/>1) Respond to questions correctly even when asked differently from the questions in training data<br/>2) Understand if follow up questions users may ask in reply to a chatbot's response are related (understand the context of questions)."
               ],
               "context": []
          },
          {
               "tag": "data_mega_customer_benefit_purpose_chatbot_access_allowing",
               "patterns": [
                    "collection mega customer benefit purpose chatbot access allowing",
                    "accumulation mega customer benefit purpose chatbot access allowing",
                    "aggregation mega customer benefit purpose chatbot access allowing",
                    "metadata mega customer benefit purpose chatbot access allowing",
                    "information mega customer benefit purpose chatbot access allowing",
                    "assemblage mega customer benefit purpose chatbot access allowing",
                    "data mega customer benefit purpose chatbot access allowing",
                    "data mega emptor benefit purpose chatbot access allowing",
                    "data mega purchaser benefit purpose chatbot access allowing",
                    "data mega warrantee benefit purpose chatbot access allowing",
                    "data mega john benefit purpose chatbot access allowing",
                    "data mega expender benefit purpose chatbot access allowing",
                    "data mega vendee benefit purpose chatbot access allowing",
                    "data mega subscriber benefit purpose chatbot access allowing",
                    "data mega shopper benefit purpose chatbot access allowing",
                    "data mega whoremaster benefit purpose chatbot access allowing",
                    "data mega trick benefit purpose chatbot access allowing",
                    "data mega reader benefit purpose chatbot access allowing",
                    "data mega buyer benefit purpose chatbot access allowing",
                    "data mega disburser benefit purpose chatbot access allowing",
                    "data mega taker benefit purpose chatbot access allowing",
                    "data mega guest benefit purpose chatbot access allowing",
                    "data mega patron benefit purpose chatbot access allowing",
                    "data mega consumer benefit purpose chatbot access allowing",
                    "data mega spender benefit purpose chatbot access allowing",
                    "data mega policyholder benefit purpose chatbot access allowing",
                    "data mega client benefit purpose chatbot access allowing",
                    "data mega whoremonger benefit purpose chatbot access allowing",
                    "data mega frequenter benefit purpose chatbot access allowing",
                    "data mega customer payment purpose chatbot access allowing",
                    "data mega customer perquisite purpose chatbot access allowing",
                    "data mega customer perk purpose chatbot access allowing",
                    "data mega customer benefit mind chatbot access allowing",
                    "data mega customer benefit sake chatbot access allowing",
                    "data mega customer benefit goal chatbot access allowing",
                    "data mega customer benefit intention chatbot access allowing",
                    "data mega customer benefit end chatbot access allowing",
                    "data mega customer benefit will chatbot access allowing",
                    "data mega customer benefit cross-purpose chatbot access allowing",
                    "data mega customer benefit view chatbot access allowing",
                    "data mega customer benefit aim chatbot access allowing",
                    "data mega customer benefit design chatbot access allowing",
                    "data mega customer benefit intent chatbot access allowing",
                    "data mega customer benefit idea chatbot access allowing",
                    "data mega customer benefit purpose chatbot access allowing",
                    "data mega customer benefit purpose chatbot entryway allowing",
                    "data mega customer benefit purpose chatbot entry allowing",
                    "data mega customer benefit purpose chatbot entree allowing",
                    "data mega customer benefit purpose chatbot way allowing",
                    "data mega customer benefit purpose chatbot entrance allowing",
                    "data mega customer benefit purpose chatbot entranceway allowing",
                    "data mega customer benefit purpose chatbot approach allowing",
                    "data mega customer benefit purpose chatbot access permit",
                    "data mega customer benefit purpose chatbot access pass",
                    "data mega customer benefit purpose chatbot access let"
               ],
               "responses": [
                    "<br/>Through access to customer data through CRM and billing systems, products used by customers and their history with the company can be identified.  This will help better understand the context of customers' queries and provide support specific to individual customers based on their needs. "
               ],
               "context": []
          },
          {
               "tag": "out_for_scope_chatbot",
               "patterns": [
                    "down for scope chatbot",
                    "out unwanted scope chatbot",
                    "out unwished scope chatbot",
                    "out unwelcome scope chatbot",
                    "out for ballpark chatbot",
                    "out for confines chatbot",
                    "out for view chatbot",
                    "out for gamut chatbot",
                    "out for extent chatbot",
                    "out for compass chatbot",
                    "out for reach chatbot",
                    "out for spectrum chatbot",
                    "out for internationalism chatbot",
                    "out for range chatbot",
                    "out for sweep chatbot",
                    "out for horizon chatbot",
                    "out for purview chatbot",
                    "out for latitude chatbot",
                    "out for orbit chatbot",
                    "out for contrast chatbot",
                    "out for internationality chatbot",
                    "out for pallet chatbot",
                    "out for palette chatbot",
                    "out for ambit chatbot",
                    "out for expanse chatbot",
                    "out for scope chatbot"
               ],
               "responses": [
                    "<br/>Mega chatbot will not be a \"chatty\" bot and will not respond to customer inputs that are not related to a company's business, services, or products. "
               ],
               "context": []
          }
     ]
}